// operator explanation.
#include <stdio.h>

// arithmatic operator
// int main(){
//     int a, b;
//     a = 10;
//     b = 3;
//     printf("a + b = %d\n", a + b);
//     printf("a - b = %d\n", a - b);
//     printf("a * b = %d\n", a * b);
//     printf("a / b = %d\n", a / b);
//     printf("a %% b = %d\n", a % b);     // %를 표시하기 위해 두번 작성함.
//     //-------------------산술 변환 과정-----------------------------
//     // 산술 변환 과정 #1 (정수,정수)
//     // int a = 10;
//     // int b = 3;
//     // printf("a / b = %f\n", a / b);   // 정수 a와 b는 정수형이라서 안됨
//     //-----------------------------------------------------------
//     // 산술 변환 과정 #2 (정수,실수)
//     // int a = 10;
//     // double b = 3;                    // double 이 더 많은 범위의 수를 포함
//     //                                  // -> 큰 범위의 표현으로 산술변환 
//     // printf("a / b = %f\n", a / b);   // 실수 3.33... 의 결과가 나옴
//     //                                  
//     //-----------------------------------------------------------
//     // 산술 변환 과정 #3 (실수,실수)
//     // double a;
//     // double b;
//     // printf("a / b = %d\n", a / b);   // 실수와 실수의 계산시 정수형출력은 안됨
//     //-----------------------------------------------------------
// return 0;
// }


// assignment & an increase/decrease operator
//int main(){
    // int c = 3;
    // c = c + 3;
    // printf("c is %d",c);
//-------------------------------------------------------------------------
    // int a = 1, b = 1, c = 1, d = 1;
    // a = a + 1;              // a에 1을 더하고 대입
    // printf("a : %d\n",a);
    // b += 1;                 // b+1과 같다
    // printf("b : %d\n",b);
    // b -= 3;
    // printf("b : %d\n",b);
    // b *= 2;
    // printf("b : %d\n",b);
    // b /= 1;
    // printf("b : %d\n",b);
//-------------------------------------------------------------------------
    // ++c;                    // 증감 연산자 (prefix) // 1을 더해준 후 결과를 반환
    // printf("c : %d\n",c);
    // d++;                    // 증감 연산자 (postfix) // 반환 후 1을 더함
    // printf("d : %d\n",d);
//-------------------------------------------------------------------------
    // int a = 1;                 // 증감연산자 예시
    // printf("++a : %d \n",++a);  // prefix
    // a = 1;
    // printf("a++ : %d \n", a++); // postfix
    // printf("a : %d \n", a);
//-------------------------------------------------------------------------
//return 0;
//}


// Bit operator explanation
// & (and)             | (or)              ^ (XOR)              <<,>> (shift)           ~ (reversal)
//--------------------------------------------------------------------------------------------------
// 1. & (and)
// one of two is false = false     (must match two of them.)
//
// i.e) 1010 & 0010 0010
//--------------------------------------------------------------------------------------------------
// 2. | (or)
// one of two is ture = true
//
// i.e) 1101 | 1000 == 1101
//--------------------------------------------------------------------------------------------------
// 3. ^ (XOR)
// two numbers are different = true
//
// i.e) 1100 ^ 1010 == 0110
//--------------------------------------------------------------------------------------------------
// 4. ~ (reversal)
// change 0 to 1, 1 to 0
//
// i.e) ~1100 == 0011
//--------------------------------------------------------------------------------------------------
// 5-1. << (shift)
// shift to the left side
//
//      * front number  :   abandonment     when there's no more place to move to the front
//      * back  number  :   0               when the space is the newly filled part by shifting
// i.e) a << 2, a ==  1    0    1    0    1    1  move 2 space to the left side
//                   <<-  <<-  <<-  <<-  <<-  <<-
//                    1    0    1    1    0    0
//--------------------------------------------------------------------------------------------------
// 5-2. >> (shift)
// shift to the right side
//      * front number : Filled with the first digit when the space is the newly filled part
//      * back  number : abandonment        when there's no more place to move to the right
//
//                  first digit == 1
// i.e #1) a << 2, a ==  1     1     1     0     0     0     1     0  move 3 space to the right side
//                      ->>>  ->>> ->>>  ->>>  ->>>   ->>>  ->>> ->>>
//                       1     1     1     1     1     1     0     0
//
//                  first digit == 0
// i.e #2) a << 2, a ==  0     0     0     1     1     0     0     1  move 3 space to the right side
//                      ->>>  ->>> ->>>  ->>>  ->>>   ->>>  ->>> ->>>
//                       0     0     0     0      0     0     1     1
//--------------------------------------------------------------------------------------------------

// bit operator test
int main(){
    int a = 0xAF; // 10101111
    int b = 0xB5; // 10110101

    printf(" a & b == %x\n", a & b);    // 10101111 & 10110101 == 10100101
    printf(" a | b == %x\n", a | b);    // 10101111 | 10110101 == 10111111
    printf(" a ^ b == %x\n", a ^ b);    // 10101111 & 10110101 == 00011010
    printf(" ~a == %x\n", ~a);          // ~10101111 == 01010000
    printf(" ~b == %x\n", ~b);          // ~10110101 == 01001010
    printf(" a << 2 == %x\n", a << 2);  // 10101111 << 2 == 10101100
    printf(" b >> 3 == %x\n", b >> 3);  // 10110101 >> 3 == 11110110
    return 0;
}